{"config": [{"config": {"activity_regularizer": null, "nb_row": 3, "batch_input_shape": [null, 60, 60, 3], "input_dtype": "float32", "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 32, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "name": "convolution2d_1", "subsample": [1, 1], "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 32, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [1, 1], "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "name": "convolution2d_3", "subsample": [1, 1], "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "W_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 500, "b_constraint": null, "input_dim": 1600}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "W_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 250, "b_constraint": null, "input_dim": 500}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "input_dim": 250}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}